newwms_gift/src/Documents/итWMSКонтрольнаяОперацияАгрегации/итWMSКонтрольнаяОперацияАгрегации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSКонтрольнаяОперацияАгрегации</name>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.итWMSРазмещение</types>
      <types>DocumentRef.итWMSНаборка</types>
      <types>String</types>
      <types>DocumentRef.итWMSПеремещение</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.итWMSПриемка</types>
      <types>DocumentRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработанОчисткойПоСрокуГодности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеАгрегацииДокумента</name>
    <attributes>
      <name>SSCC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>26</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>26</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>CatalogRef.Марки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характиристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеДляАгрегацииДокумента</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характиристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/итWMSКонтрольнаяОперацияАгрегации/Forms/ФормаРасхождений/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("ОбъектАнализа") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;
	ОбъектАнализа=Параметры.ОбъектАнализа;
 ЗаполнитьДаннымиРасхождения();
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДаннымиРасхождения()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента.Номенклатура КАК Номенклатура,
		|	итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента.Характиристика КАК Характеристика,
		|	итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
		|	итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента.СерияНоменклатуры.алкДатаНачалаРозлива КАК ДатаРозлива,
		|	итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента.Количество КАК КоличествоПлан,
		|	NULL КАК КоличествоФакт
		|ПОМЕСТИТЬ ВтДанныеПроверки
		|ИЗ
		|	Документ.итWMSКонтрольнаяОперацияАгрегации.ДанныеДляАгрегацииДокумента КАК итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента
		|ГДЕ
		|	итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.Номенклатура,
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.Характеристика,
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.СерияНоменклатуры,
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.СерияНоменклатуры.алкДатаНачалаРозлива,
		|	NULL,
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.Количество
		|ИЗ
		|	Документ.итWMSКонтрольнаяОперацияАгрегации.Товары КАК итWMSКонтрольнаяОперацияАгрегацииТовары
		|ГДЕ
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтДанныеПроверки.Номенклатура,
		|	ВтДанныеПроверки.Характеристика,
		|	ВтДанныеПроверки.СерияНоменклатуры,
		|	ВтДанныеПроверки.ДатаРозлива,
		|	СУММА(ЕСТЬNULL(ВтДанныеПроверки.КоличествоПлан, 0)) КАК КоличествоПлан,
		|	СУММА(ЕСТЬNULL(ВтДанныеПроверки.КоличествоФакт, 0)) КАК КоличествоФакт
		|ПОМЕСТИТЬ ВтДанныеПроверкиГруппировка
		|ИЗ
		|	ВтДанныеПроверки КАК ВтДанныеПроверки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтДанныеПроверки.Номенклатура,
		|	ВтДанныеПроверки.СерияНоменклатуры,
		|	ВтДанныеПроверки.ДатаРозлива,
		|	ВтДанныеПроверки.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтДанныеПроверкиГруппировка.Номенклатура,
		|	ВтДанныеПроверкиГруппировка.СерияНоменклатуры,
		|	ВтДанныеПроверкиГруппировка.ДатаРозлива,
		|	ВтДанныеПроверкиГруппировка.КоличествоПлан,
		|	ВтДанныеПроверкиГруппировка.КоличествоФакт
		|ИЗ
		|	ВтДанныеПроверкиГруппировка КАК ВтДанныеПроверкиГруппировка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.ИдентификаторУпаковки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВтДанныеПроверкиГруппировка.Номенклатура КАК Номенклатура,
		|		ВтДанныеПроверкиГруппировка.Характеристика КАК Характеристика,
		|		ВтДанныеПроверкиГруппировка.СерияНоменклатуры КАК СерияНоменклатуры,
		|		ВтДанныеПроверкиГруппировка.ДатаРозлива КАК ДатаРозлива,
		|		ЕСТЬNULL(ВтДанныеПроверкиГруппировка.КоличествоПлан, 0) КАК КоличествоПлан,
		|		ЕСТЬNULL(ВтДанныеПроверкиГруппировка.КоличествоФакт, 0) КАК КоличествоФакт
		|	ИЗ
		|		ВтДанныеПроверкиГруппировка КАК ВтДанныеПроверкиГруппировка
		|	ГДЕ
		|		ВтДанныеПроверкиГруппировка.КоличествоПлан = 0
		|		И ВтДанныеПроверкиГруппировка.КоличествоФакт > 0) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.итWMSКонтрольнаяОперацияАгрегации.Товары КАК итWMSКонтрольнаяОперацияАгрегацииТовары
		|		ПО ВложенныйЗапрос.Номенклатура = итWMSКонтрольнаяОперацияАгрегацииТовары.Номенклатура
		|			И ВложенныйЗапрос.СерияНоменклатуры = итWMSКонтрольнаяОперацияАгрегацииТовары.СерияНоменклатуры
		|ГДЕ
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.ИдентификаторУпаковки";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектАнализа);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ДанныеРасхождения.Очистить();
	ДанныеРасхождения.Загрузить(МассивРезультатов[2].Выгрузить());
	
	ВыборкаИдентификаторов=МассивРезультатов[3].Выбрать();
	ПаллетыСРасхождениями.Очистить();
	пока ВыборкаИдентификаторов.Следующий() цикл
		ПаллетыСРасхождениями.Добавить(ВыборкаИдентификаторов.ИдентификаторУпаковки);
		КонецЦикла;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	КонецПроцедуры

&НаКлиенте
	Процедура ЗакрытьФорму(Команда)
		ЭтаФорма.Закрыть();
	КонецПроцедуры
